In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
df1 = DataFrame({'key':['x','y','z'],
                  'dataset_1':[1,2,3]
                })
df1

  key  dataset_1
0   x          1
1   y          2
2   z          3

In [5]:
df2 = DataFrame({'key':['x','B','C'],
                  'dataset_2':[4,5,6]
                })
df2

  key  dataset_2
0   x          4
1   B          5
2   C          6

In [6]:
pd.merge(df1,df2)

  key  dataset_1  dataset_2
0   x          1          4

In [9]:
#要共有的colunmn下的值
pd.merge(df1,df2,on='key',how='inner')

  key  dataset_1  dataset_2
0   x          1          4

In [10]:
pd.merge(df1,df2,on='key',how='left')

  key  dataset_1  dataset_2
0   x          1        4.0
1   y          2        NaN
2   z          3        NaN

In [11]:
pd.merge(df1,df2,on='key',how='outer')

  key  dataset_1  dataset_2
0   x        1.0        4.0
1   y        2.0        NaN
2   z        3.0        NaN
3   B        NaN        5.0
4   C        NaN        6.0